התשובה לחידת  נתיב הזהב
 נחלק את העבודה לשלבים
 ראשית יש צורך להסתכל על החידה בצד הפיזיקלי שלה
 אשתמש במשוואות הנתונות לניתוח הבעיה בעזרת הנתונים
 שלב ראשון - הפיזיקה מאחורי החישובים
 -----------------------------------------------------
  זמן הטיסה המקסימלי t <= 60 [sec]
  הכוח שמופק ע"י המונעים F = 100,000[N]
  מסת המטוס + הנוסעים m1 = 35,000[kg]
  
  ידוע כי המטוס מתחיל עם מהירות ומיקום התחלתי אפס
  וכדי להמריא עליו להגיע ל 140 מטר לשנייה
  ולכן נציב 
  מהירות המטוס v = 140[m/sec]
  בנוסף יש לקלוט מהמשתמש את מסת הכבודה m2 = נקלט[kg]
  
  בהנחה שמתעלמים מחיכוך עם האוויר, ובכך שתאוצת המטוס קבועה
  אשתמש במשוואה הראשונה הנובעת מהחוק השני של ניוטון כדי להגיע 
  לביטוי לתאוצה המשלב את נתוני השאלה וקלט המשתמש
  
  לאחר מכן אציב במשוואה השנייה - משוואת מהירות שוות תאוצה את תאוצת המטוס
  ואציב את מהירות המטוס - 140 מטר לשנייה
  כעת אחלק את שני אגפי המשוואה בתאוצה ואקבל את הזמן הדרוש למטוס להמראה 
  
  כעת יש לנו את כל המידע שאנו צריכים לחישוב המרחק שיעבור המטוס עד להמראה
  נציב במשוואת מקום זמן חצי כפול תאוצת המטוס כפול הזמן שחישבנו בריבוע ונקבל את המרחק שיעבור המטוס
  
  שלב שני - מקרה קיצון, טיפול ופיתרון
  ---------------------------------------------------
  
  כעת יש ליישם את המידע ולשים לב למקרי קיצון בהם הכבודה עולה על המשקל המקסימלי איתו
  ניתן להמריא תוך 60 שניות מקס
  
  ראשית, לאחר קליטת הכבודה מהמשתמש נבדוק בעזרת מספר קבוע שאותו אחשב האם הכבודה עולה על 
  המשקל המקסימלי
  
  כדי לחשב זאת נציב במשוואת מהירות שוות תאוצה שהזמן שווה לשישים - הזמן המקסימלי
  
  כעת נקבל כי הכבודה המקסימלית שניתן להעלות למטוס הינה
  m2(max) = 7,857.14[kg]
 כעת נציג למשתמש כמה הוא צריך להחסיר כדי שהמטוס יוכל לטוס בזריזות
 m2(קלט) - m2(max) = המשקל אותו יש להחסיר
 
 נניח כי הצוות מעוניין בכמה שיותר מאותה כבודה ולכן נציג לו נתונים בהתאם 
 אותם נחשב
 הנתונים לכבודה המקסימלית לאחר הורדת הכבודה העודפת לאחר חישוב
 הינם:
 t = 60[sec]
 m1 = 35,000[kg]
 m2 = 7,857.14[kg]
 F = 100,000[N]
 x(מרחק המראה) = 4200[m] = 4.2[km]
 
 
 לאחר הצגת נתונים אלו ניתן למשתמש לקלוט שוב מידע למקרה והחליט להוריד יותר מהכמות המקסימלית הניתנת
 
שלב שלישי חידות בונוס
------------------------------------------------------------------------------
5 .שאלה: איך נוכל לוודא כי השירות שבנינו מוסר ללקוח תשובות נכונות? אילו
מקרי קצה עלולים לצוץ בעת שימוש במערכת? כיצד נתמודד איתם?

נוכל לוודא בעזרת ניסוי וטעייה של מקרים שונים ומקרי קצה, ובעזרת בידוד וקיבוע משתנים.

מקרי קצה אשר עלולים להופיע הינם - המרחק אשר נדרש להמראה גדול מהמרחק הקיים בשטח - פתרון: הקצאת מרחק מראש למערכת ובכך חישוב
מחודש של הכבודה המקסימלית - ובכך יהיה ניתן להתאים את המשקל שנוכל להמריא גם במרחק הנתון
מקרה קצה נוסף הינו פגיעה במטוס - ובכך פגיעה בגודל כוח המנועים פתרון: 
דרישת קלט כוח המנועים במקרה קצה
בעיה נוספת שיכולה לצוץ היא קלט לא תקין - מספר שלילי/מחרוזת. נדאג לבדוק זאת בקוד ולתת הודעה בהתאם.

6 .שאלת בונוס: המודל הפיזיקלי שאנחנו מממשים כאן לא מתאר בצורה מדויקת
לחלוטין התנהגות מציאותית. כיצד נשפר את המודל כך שיהיה מדויק יותר? אילו
תנאי סביבה של המציאות ניתן יהיה לדעתכם לממש במודל?
 
 נתון כי F/m = a
 כאשר F הינו כוח המנועים ו -m הינה המסה של המטוס כולל הצוות
והמטען.
במציאות יש להתחשב בחיכוך עם הרוח, כוח הכובד, זווית ההמראה, חיכוך הגלגלים עם האדמה ושתאוצת הגוף אינה קבועה.
ניתן לשלב את כוח הכובד בחישוב, זווית ההמראה כדי לחשב את המרחק האופקי האמיתי שעובר המטוס ותאוצת המטוס למרות שהיא משתנה ניתן
יהיה לשלב ממסד נתונים שיאגור מידע ויחשב אותה בעזרתו.
 
 שלב רביעי - יישום בקוד
 ------------------------------------------------------------------------------
 כעת ליישם בקוד
 נקלוט מהמשתמש את המסה
 נשתמש בחישובים קודמים להציג לו את הזמן והמרחק
 שאותם יעבור 
 במקרה והכבודה כבדה מידי נציג לו כמה יש להחסיר
 אשתמש ב-Node.js ו-React  כדי להציג את המחשבון הפיזיקלי למשתמש בצורה נוחה לשימוש - אפרט על כך בחלק הבא....
